<template>
  <div class="info-page">
    <h1>Привет! Меня зовут Арсен, я front-end разработчик.</h1>
    <div class="info-page__description">
      <p>
        Мне 20 лет, я учусь в Уфимском университете науки и технологии на 3 курсе. Моя
        специальность - Информатика и вычислительная техника. Знакомство с JS у меня
        началось 2 года назад в университетском конкурсе. Я разрабатывал мобильное
        приложение для алгоритмической торговли на бирже (использовал React Native).
      </p>
      <p>
        Web-разработка заинтересовала меня уже тогда. Я начал с верстки и через некоторое
        время начал писать pet проекты на Lit-elements.
      </p>
      <p>
        Коммерческой разработкой я начал заниматься полтора года назад. Тогда я устроился
        в компанию, разрабатывающую информационные системы для экстренных служб (112,
        122).
      </p>
    </div>
    <div class="info-page__stack">
      <p>
        За 1.5 года я познакомился с большим количеством технологий. В работе я
        использовал:
      </p>
      <p>WebSocket</p>
      <p>Веб-телефония JsSip</p>
      <p>Стейт менеджеры Vuex, Pinia</p>
      <p>Разработка интерактивных карт с помощью Leaflet, OpenLayers</p>
      <p>UI киты Beutify, Element Plus</p>
    </div>
  </div>
</template>

<script setup lang="ts"></script>

<style scoped lang="scss"></style>
